//-----------------------------------------------
//
//	This file is part of the Siv3D Engine.
//
//	Copyright (c) 2008-2026 Ryo Suzuki
//	Copyright (c) 2016-2026 OpenSiv3D Project
//
//	Licensed under the MIT License.
//
//-----------------------------------------------

# pragma once
# include "Common.hpp"
# include "String.hpp"

namespace s3d
{
	struct PenCaps;
	struct PenState;

	namespace Pentablet
	{
		////////////////////////////////////////////////////////////////
		//
		//	IsAvailable
		//
		////////////////////////////////////////////////////////////////

		/// @brief ペンタブレット機能が利用可能かを返します。
		/// @return 利用可能な場合 true, それ以外の場合は false
		[[nodiscard]]
		bool IsAvailable();

		////////////////////////////////////////////////////////////////
		//
		//	IsConnected
		//
		////////////////////////////////////////////////////////////////

		/// @brief ペンタブレットが PC に接続されているかを返します。
		/// @return 接続されている場合 true, それ以外の場合は false
		[[nodiscard]]
		bool IsConnected();

		////////////////////////////////////////////////////////////////
		//
		//	GetName
		//
		////////////////////////////////////////////////////////////////

		/// @brief ペンタブレットのデバイス名を返します。
		/// @return デバイス名
		[[nodiscard]]
		const String& GetName();

		////////////////////////////////////////////////////////////////
		//
		//	GetCaps
		//
		////////////////////////////////////////////////////////////////

		/// @brief ペンタブレットがサポートする機能（取得可能な項目）を返します。
		/// @return 機能サポート情報
		[[nodiscard]]
		const PenCaps& GetCaps();

		////////////////////////////////////////////////////////////////
		//
		//	GetState
		//
		////////////////////////////////////////////////////////////////

		/// @brief ペンタブレットの入力状態を返します。
		/// @return ペンタブレットの入力状態
		/// @remark `System::Update()` の呼び出しごとに更新されます。
		[[nodiscard]]
		const PenState& GetState();
	}
}
